evidence/testing/step2-monitoring/k6-smoke-test-final.txt

         /\      Grafana   /ظ╛ظ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ظ╛ظ╛\ 
  /          \   |   (  |  (ظ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/smoke.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 3 looping VUs for 1m0s (gracefulStop: 30s)

time="2026-05-03T19:46:11+03:00" level=info msg="≡اأ Starting Smoke Test against: https://localhost:44368" source=console
time="2026-05-03T19:46:11+03:00" level=info msg="≡اôè Test will run for 1 minute with 3 virtual users" source=console
time="2026-05-03T19:46:11+03:00" level=info msg="ظ£à API check passed. Starting test..." source=console

running (0m00.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 3 VUs  0m00.9s/1m0s
time="2026-05-03T19:46:12+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m01.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 3 VUs  0m01.9s/1m0s
time="2026-05-03T19:46:13+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m02.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   5% ] 3 VUs  0m02.9s/1m0s
time="2026-05-03T19:46:14+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m03.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 3 VUs  0m03.9s/1m0s
time="2026-05-03T19:46:15+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m04.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 3 VUs  0m04.9s/1m0s
time="2026-05-03T19:46:16+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m05.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 3 VUs  0m05.9s/1m0s
time="2026-05-03T19:46:17+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m06.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [  11% ] 3 VUs  0m06.9s/1m0s
time="2026-05-03T19:46:18+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m07.9s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [  13% ] 3 VUs  0m07.9s/1m0s
time="2026-05-03T19:46:19+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m08.9s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [  15% ] 3 VUs  0m08.9s/1m0s
time="2026-05-03T19:46:20+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m09.9s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  16% ] 3 VUs  0m09.9s/1m0s
time="2026-05-03T19:46:21+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m10.9s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  18% ] 3 VUs  0m10.9s/1m0s
time="2026-05-03T19:46:22+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m11.9s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [  20% ] 3 VUs  0m11.9s/1m0s
time="2026-05-03T19:46:23+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m12.9s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  22% ] 3 VUs  0m12.9s/1m0s
time="2026-05-03T19:46:24+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m13.9s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  23% ] 3 VUs  0m13.9s/1m0s
time="2026-05-03T19:46:25+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m14.9s), 3/3 VUs, 27 complete and 0 interrupted iterations
default   [  25% ] 3 VUs  0m14.9s/1m0s
time="2026-05-03T19:46:26+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m15.9s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  27% ] 3 VUs  0m15.9s/1m0s
time="2026-05-03T19:46:27+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m16.9s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  28% ] 3 VUs  0m16.9s/1m0s
time="2026-05-03T19:46:28+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m17.9s), 3/3 VUs, 33 complete and 0 interrupted iterations
default   [  30% ] 3 VUs  0m17.9s/1m0s
time="2026-05-03T19:46:29+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m18.9s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  31% ] 3 VUs  0m18.9s/1m0s
time="2026-05-03T19:46:30+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m19.9s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  33% ] 3 VUs  0m19.9s/1m0s
time="2026-05-03T19:46:31+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m20.9s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  35% ] 3 VUs  0m20.9s/1m0s
time="2026-05-03T19:46:32+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m21.9s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  37% ] 3 VUs  0m21.9s/1m0s
time="2026-05-03T19:46:33+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m22.9s), 3/3 VUs, 42 complete and 0 interrupted iterations
default   [  38% ] 3 VUs  0m22.9s/1m0s
time="2026-05-03T19:46:34+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m23.9s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  40% ] 3 VUs  0m23.9s/1m0s
time="2026-05-03T19:46:35+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m24.9s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  41% ] 3 VUs  0m24.9s/1m0s
time="2026-05-03T19:46:36+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m25.9s), 3/3 VUs, 48 complete and 0 interrupted iterations
default   [  43% ] 3 VUs  0m25.9s/1m0s
time="2026-05-03T19:46:37+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m26.9s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  45% ] 3 VUs  0m26.9s/1m0s
time="2026-05-03T19:46:38+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m27.9s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  47% ] 3 VUs  0m27.9s/1m0s
time="2026-05-03T19:46:39+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m28.9s), 3/3 VUs, 54 complete and 0 interrupted iterations
default   [  48% ] 3 VUs  0m28.9s/1m0s
time="2026-05-03T19:46:40+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m29.9s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  50% ] 3 VUs  0m29.9s/1m0s
time="2026-05-03T19:46:41+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m30.9s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  51% ] 3 VUs  0m30.9s/1m0s
time="2026-05-03T19:46:42+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m31.9s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  53% ] 3 VUs  0m31.9s/1m0s
time="2026-05-03T19:46:43+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m32.9s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  55% ] 3 VUs  0m32.9s/1m0s
time="2026-05-03T19:46:44+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m33.9s), 3/3 VUs, 63 complete and 0 interrupted iterations
default   [  57% ] 3 VUs  0m33.9s/1m0s
time="2026-05-03T19:46:45+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m34.9s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  58% ] 3 VUs  0m34.9s/1m0s
time="2026-05-03T19:46:46+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m35.9s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  60% ] 3 VUs  0m35.9s/1m0s
time="2026-05-03T19:46:47+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m36.9s), 3/3 VUs, 69 complete and 0 interrupted iterations
default   [  61% ] 3 VUs  0m36.9s/1m0s
time="2026-05-03T19:46:48+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m37.9s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  63% ] 3 VUs  0m37.9s/1m0s
time="2026-05-03T19:46:49+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m38.9s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  65% ] 3 VUs  0m38.9s/1m0s
time="2026-05-03T19:46:50+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m39.9s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  67% ] 3 VUs  0m39.9s/1m0s
time="2026-05-03T19:46:51+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m40.9s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  68% ] 3 VUs  0m40.9s/1m0s
time="2026-05-03T19:46:52+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m41.9s), 3/3 VUs, 78 complete and 0 interrupted iterations
default   [  70% ] 3 VUs  0m41.9s/1m0s
time="2026-05-03T19:46:53+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m42.9s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  71% ] 3 VUs  0m42.9s/1m0s
time="2026-05-03T19:46:54+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m43.9s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  73% ] 3 VUs  0m43.9s/1m0s
time="2026-05-03T19:46:55+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m44.9s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  75% ] 3 VUs  0m44.9s/1m0s
time="2026-05-03T19:46:56+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m45.9s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  77% ] 3 VUs  0m45.9s/1m0s
time="2026-05-03T19:46:57+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m46.9s), 3/3 VUs, 87 complete and 0 interrupted iterations
default   [  78% ] 3 VUs  0m46.9s/1m0s
time="2026-05-03T19:46:58+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m47.9s), 3/3 VUs, 90 complete and 0 interrupted iterations
default   [  80% ] 3 VUs  0m47.9s/1m0s
time="2026-05-03T19:46:59+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m48.9s), 3/3 VUs, 90 complete and 0 interrupted iterations
default   [  82% ] 3 VUs  0m48.9s/1m0s
time="2026-05-03T19:47:00+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m49.9s), 3/3 VUs, 93 complete and 0 interrupted iterations
default   [  83% ] 3 VUs  0m49.9s/1m0s
time="2026-05-03T19:47:01+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m50.9s), 3/3 VUs, 93 complete and 0 interrupted iterations
default   [  85% ] 3 VUs  0m50.9s/1m0s
time="2026-05-03T19:47:02+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m51.9s), 3/3 VUs, 96 complete and 0 interrupted iterations
default   [  87% ] 3 VUs  0m51.9s/1m0s
time="2026-05-03T19:47:03+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m52.9s), 3/3 VUs, 99 complete and 0 interrupted iterations
default   [  88% ] 3 VUs  0m52.9s/1m0s
time="2026-05-03T19:47:04+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m53.9s), 3/3 VUs, 99 complete and 0 interrupted iterations
default   [  90% ] 3 VUs  0m53.9s/1m0s
time="2026-05-03T19:47:05+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m54.9s), 3/3 VUs, 102 complete and 0 interrupted iterations
default   [  92% ] 3 VUs  0m54.9s/1m0s
time="2026-05-03T19:47:06+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m55.9s), 3/3 VUs, 102 complete and 0 interrupted iterations
default   [  93% ] 3 VUs  0m55.9s/1m0s
time="2026-05-03T19:47:07+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m56.9s), 3/3 VUs, 105 complete and 0 interrupted iterations
default   [  95% ] 3 VUs  0m56.9s/1m0s
time="2026-05-03T19:47:08+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m57.9s), 3/3 VUs, 105 complete and 0 interrupted iterations
default   [  97% ] 3 VUs  0m57.9s/1m0s
time="2026-05-03T19:47:09+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m58.9s), 3/3 VUs, 108 complete and 0 interrupted iterations
default   [  98% ] 3 VUs  0m58.9s/1m0s
time="2026-05-03T19:47:10+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (0m59.9s), 3/3 VUs, 111 complete and 0 interrupted iterations
default   [ 100% ] 3 VUs  0m59.9s/1m0s
time="2026-05-03T19:47:11+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1

running (1m00.9s), 3/3 VUs, 111 complete and 0 interrupted iterations
default ظô [ 100% ] 3 VUs  1m0s
time="2026-05-03T19:47:12+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1
time="2026-05-03T19:47:13+03:00" level=info msg="\n≡اôè Test Summary:" source=console
time="2026-05-03T19:47:13+03:00" level=info msg="   Started:  2026-05-03T16:46:11.560Z" source=console
time="2026-05-03T19:47:13+03:00" level=info msg="   Ended:    2026-05-03T16:47:13.021Z" source=console
time="2026-05-03T19:47:13+03:00" level=info msg="\nظ£à Check Grafana for detailed metrics: http://localhost:3000" source=console
time="2026-05-03T19:47:13+03:00" level=error msg="Couldn't write stats" error="{\"error\":\"unable to parse authentication credentials\"}\n" output=InfluxDBv1


  ظûê THRESHOLDS 

    custom_error_rate
    ظ£ô 'rate<0.01' rate=0.00%

    http_req_duration
    ظ£ô 'p(95)<500' p(95)=92.28ms

    http_req_failed
    ظ£ô 'rate<0.01' rate=0.00%


  ظûê TOTAL RESULTS 

    checks_total.......: 570     9.269422/s
    checks_succeeded...: 100.00% 570 out of 570
    checks_failed......: 0.00%   0 out of 570

    ظ£ô api-config: status 200
    ظ£ô api-config: response fast
    ظ£ô api-definition: success
    ظ£ô api-definition: not empty
    ظ£ô api-definition: valid json

    CUSTOM
    custom_error_rate..............: 0.00%  0 out of 228

    HTTP
    http_req_duration..............: avg=34.11ms min=4.13ms med=27.66ms max=135.68ms p(90)=77.94ms p(95)=92.28ms
      { expected_response:true }...: avg=34.11ms min=4.13ms med=27.66ms max=135.68ms p(90)=77.94ms p(95)=92.28ms
    http_req_failed................: 0.00%  0 out of 229
    http_reqs......................: 229    3.724031/s

    EXECUTION
    iteration_duration.............: avg=1.61s   min=1.54s  med=1.59s   max=1.85s    p(90)=1.72s   p(95)=1.75s  
    iterations.....................: 114    1.853884/s
    vus............................: 3      min=3        max=3
    vus_max........................: 3      min=3        max=3

    NETWORK
    data_received..................: 40 MB  657 kB/s
    data_sent......................: 144 kB 2.3 kB/s



running (1m01.5s), 0/3 VUs, 114 complete and 0 interrupted iterations
default ظ£ô [ 100% ] 3 VUs  1m0s